from magpie import Magpie


magpie = Magpie(
keras_model =  'save/model/here.h5',
word2vec_model =  'save/embeddings/here.',
scaler = 'save/scaler/here.',
labels = ['1111', '1112', '1113', '1114', '1115', '1116', '1117', '1118', '1121', '1122', '1123', '1124', '1131', '1132', '1133', '1134', '1135', '1141', '1142', '1143', '1144', '1151', '1152', '1153', '1154', '1211', '1212', '1213', '1214', '1215', '1216', '1217', '1218', '1219', '1221', '1222', '1223', '1231', '1232', '1233', '1234', '1235', '1241', '1242', '1243', '1251', '1311', '1312', '1313', '1314', '1321', '1322', '1323', '1331', '1332', '1333', '1334', '1341', '1342', '1343', '1344', '1345', '1351', '1411', '1421', '1431', '1441', '15', '2111', '2112', '2113', '2114', '2115', '2116', '2117', '2121', '2122', '2123', '2124', '2131', '2132', '2133', '2134', '2141', '2142', '2143', '2144', '2145', '2146', '2147', '2148', '2149', '21410', '2151', '2152', '2153', '2154', '2155', '2156', '2161', '2162', '2163', '2164', '2165', '2166', '2167', '2168', '2171', '2172', '2173', '2174', '2175', '2176', '2177', '2178', '2179', '21710', '21711', '2181', '2182', '2183', '2184', '2185', '2186', '2187', '2188', '2191', '2192', '2193', '2194', '2195', '2196', '221', '222', '223', '224', '2311', '2312', '2313', '2314', '2315', '2316', '2321', '2322', '2323', '2324', '24', '31', '32', '33', '34', '41', '42', '43', '51', '52', '53', '54', '55', '56', '57', '58', '61', '7111', '7112', '7113', '7114', '7115', '7116', '7117', '7118', '7119', '71110', '71111', '7121', '7122', '7123', '7124', '7125', '7126', '7127', '7128', '7129', '7131', '7132', '7133', '7134', '7135', '7136', '7137', '7138', '7139', '71310', '71311', '71312', '7141', '7142', '7151', '721', '722', '723', '724', '7311', '7312', '7313', '7314', '7315', '7316', '7321', '7322', '7323', '7324', '7325', '7326', '7331', '7332', '7333', '7334', '7335', '7336', '734', '74'])
# 单条模拟测试数据

text1 = '喂你好|哎，你好，我就是想问一下|我这个手机号怎么登不了那个？|12306呀嗯，是您不知道用户名对对对密码忘记了那您还是通过铁路1236的手机|去操作|注册到最后一|提示，该证件号码已被他有在线办理的提示|在线办理|别办理之前的信息，注销以后|车在线半折对通过铁路12306|他说他是说我|我操作，他是有什么那个显示这个那个微微定时嘛，是啥意思啊，就是那个你是点击登录了您，点击注册|按照处|操作到最后一步。|如果系统提示该证件号码已被点击在线办理，通过人脸识别，把这|说哦|你这不是注册账号是吧对点击|小说哦，好，谢谢啊客气好的，感谢来电再见好'
mag1 = magpie.predict_from_text(text1)
print(mag1)


text2 = '您好，欢迎致电拦住客服喂你好你好那个咱们曾经到到兰州的那个火车，几点的从哪到兰州的红星重新造兰州是吗？呃，重新到兰州稍等|今天的吗？那今天的重新到兰州，今天再没有车了，再有车的话就24号，凌晨1点31，需要今天夜里去坐车的。|凌晨1.311k9663，每天只有这一趟列车每天就是这一趟列车对，是的就这一趟列车，凌晨1点31从新开车。同学科的零件的，就就你家的那一就用那一个车，通过那条，他就没有的对是的那个车到兰州，几点早晨9点199.9.19对9点19那个到了，到了钱，水是几到天水是吗？但是家里，哎|天水到天水没有直接能到的车，只能中转的到天水直接门到的没有就来就来就是兰州到到现在都没有。兰州到天水有啊，重新没有兰州的就是来就到多来，丢到天水的。兰州到天水，早晨10点46，再就11.0211.03，兰州大田四就是这个车到。到到到到到那个几几点|下午15点5310.53对|还有其他需要咨询吗？那个那个这是咱们那，那就到这到到底他有没有商家村是吗？张家川、张家川兰州到张家车的话，每天只有一趟凌晨3点55可以1616凌晨的对是的哦，这没有的对每天只有这一趟列车，零成分513天再放进去对那个那那个，那就到到到家几个小时，小的200兰州的泉水，如果兰州站乘坐普通列车的话，4到5个小时左右，如果失去了周西客站坐高铁的话，一个多小时。那那那就说这个这个坐高铁到到钱给你多少钱从兰州西到天水，如果是高铁的话，二等座从咱周期到天水二等座是8323包不？不不那个呃|啊，普普通车多少钱，这怎么就到香水普通列车硬座51.5元是一块5对知道好的感谢来电再见'
mag2 = magpie.predict_from_text(text2)
print(mag2)


text3 = '您好，欢迎致电兰州客服我想问一下，我那个就我买的来兰州出发，我如果在那个那个东站哦，那些人不能就去西客站坐车，可不可以你买的是从买我买的是在兰州火车站的，但是我可不可以在11上去兰州到哪里的？他就在哪呢，那个就是在银川银川呢是买的是从兰州到银川的，要从兰州去做车是吗？我可不可以在西站多少那兰州西到兰州，这一段，不在你的乘车区间之内，兰州、西城做不了的，要么那不是对，要不就到车站的人工改签窗口去查询，如果兰州西到银川有票的情况下|可以在车站办理改签、办理、改签以后啊，你看没有规定的出发站去差不多对我知道了，谢谢不客气，好的感谢来电再见'
mag3 = magpie.predict_from_text(text3)
print(mag3)



'''
#也可以通过从txt文件中读取测试数据进行批量测试
 mag2 = magpie.predict_from_file('data/hep-categories/1002413.txt')
 print(mag2)
'''

